# Напишите программу, которая выводит следующий треугольник, состоящий из звёздочек (*):
# *
# **
# ***
# ****
# *****
# ******
# *******
                
# Формат входных данных
# На вход программе ничего не подаётся.

# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.

print('*')
print('**')
print('***')
print('****')
print('*****')
print('******')
print('*******')